eruditelite/attiny/examples/blink/callbacks.c
/*
  callbacks.c
*/

#include "attiny85_wr.h"

#include <util/delay.h>
#include <avr/io.h>
#include <usitwislave.h>

extern unsigned int delay;

/*
  ------------------------------------------------------------------------------
  i2c_callback
*/

void
i2c_callback(uint8_t input_buffer_length,
	     const uint8_t *input_buffer,
	     uint8_t *output_buffer_length,
	     uint8_t *output_buffer)
{
	int i;

	for (i = 0; i < input_buffer_length; ++i) {
		switch (input_buffer[i]) {
		case 0x00:
			/* Return the magic number, 0xbacd. */
			output_buffer[0] = MAGIC & 0xff;
			output_buffer[1] = (MAGIC & 0xff00) >> 8;
			*output_buffer_length = 2;
			break;
		case 0x01:
			/* Return the project. */
			output_buffer[0] = PROJECT & 0xff;
			output_buffer[1] = (PROJECT & 0xff00) >> 8;
			*output_buffer_length = 2;
			break;
		case 0x02:
			/* Return the version. */
			output_buffer[0] = VERSION & 0xff;
			output_buffer[1] = (VERSION & 0xff00) >> 8;
			*output_buffer_length = 2;
			break;
		case 0x3:
			/* Get the delay. */
			output_buffer[0] = delay & 0xff;
			output_buffer[1] = (delay & 0xff00) >> 8;
			output_buffer[2] = (delay & 0xff0000) >> 16;
			output_buffer[3] = (delay & 0xff000000) >> 24;
			*output_buffer_length = 4;
			break;
		case 0x83:
			/* Set the delay. */
			delay = input_buffer[4];
			delay <<= 8;
			delay |= input_buffer[3];
			delay <<= 8;
			delay |= input_buffer[2];
			delay <<= 8;
			delay |= input_buffer[1];
			break;
		default:
			break;
		}
	}

	return;
}
